SpacehuhnTech/arduino/wifiduck/samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Adafruit Trinket M0 (SAMD21)
# ------------------------------
trinket.name=SAMD21E18
trinket.vid.0=0x239A
trinket.pid.0=0x801E
trinket.vid.1=0x239A
trinket.pid.1=0x001E
trinket.upload.tool=bossac
trinket.upload.protocol=sam-ba
trinket.upload.maximum_size=262144
trinket.upload.offset=0x2000
trinket.upload.use_1200bps_touch=true
trinket.upload.wait_for_upload_port=true
trinket.upload.native_usb=true
trinket.build.mcu=cortex-m0plus
trinket.build.f_cpu=48000000L
trinket.build.usb_product="Trinket M0"
trinket.build.usb_manufacturer="Adafruit"
trinket.build.board=TRINKET_M0
trinket.build.core=arduino
trinket.build.extra_flags=-DCRYSTALLESS -Dtrinket -D__SAMD21E18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
trinket.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
trinket.build.openocdscript=openocd_scripts/trinket_m0.cfg
trinket.build.variant=trinket_m0
trinket.build.variant_system_lib=
trinket.build.vid=0x239A
trinket.build.pid=0x801E
trinket.bootloader.tool=openocd
trinket.bootloader.file=trinketM0/bootloader-trinket_m0-v2.0.0-adafruit.5.bin
